Public Member Functions | Public Attributes | List of all members
API_InternalAnalyticalMemberPartId Class Reference
Analytical Model
Describes a Structural Analytical Model Analytical Member part. More...
#include <APIdefs_AnalyticalElements.h>
 Public Member Functions
 bool  | operator== (const API_InternalAnalyticalMemberPartId &right) const
 ULong  | GenerateHashValue () const
 Public Attributes
 UIndex  | contourIdx
 UIndex  | edgeOrVertexIdx
 UIndex  | edgeFragmentIndex
Detailed Description
Describes a Structural Analytical Model Analytical Member part.
Since
Archicad 25